var shape = [];
var circle = [{
	name: "服务台",
	x: 686.67,
	y: 3095,
	direction: 4
}, {
	name: "电子书",
	x: 686.67,
	y: 2680,
	direction: 4
}, {
	name: "前沿",
	x: 686.67,
	y: 2363,
	direction: 4
}, {
	name: "第八次发掘工作照",
	x: 686.67,
	y: 1685,
	direction: 4
}, {
	name: "导航图",
	x: 1163,
	y: 2869,
	direction: 3
}, {
	name: "序言",
	x: 1441,
	y: 2730,
	direction: 3
}, {
	name: "语录栏",
	x: 3927,
	y: 2207,
	direction: 4
}, {
	name: "测年表",
	x: 4066,
	y: 2209,
	direction: 2
}, {
	name: "G101遗址屏面图",
	x: 5658,
	y: 2200,
	direction: 2
}, {
	name: "电子书",
	x: 6435,
	y: 668,
	direction: 1
}];
var starts = [{
	name: "墓葬三叠层",
	x: 1425,
	y: 902,
	direction: 1,
	desc: "叠压关系的三座墓葬，编号自上而下为M126、M137、M140。这个现象反映了该墓地长期被重复使用的情况。M126为残墓。M137墓主人为一25岁年轻女性，“日本人骨”特性。M140墓主人为一青年男性，其第三尾椎骨有骨质增生病灶。",
	pic: "mzsdc"
}, {
	name: "男女合葬墓",
	x: 1686,
	y: 902,
	direction: 3,
	desc: "M131号墓为男女合葬墓，为昙石山文化中异性合葬墓的第二例，首例发现于距此不远的闽侯白沙溪头遗址，该现象反映了昙石山文化晚期父权制的确立。",
	pic: "nnhzm"
}, {
	name: "东方神灯介绍",
	x: 1944,
	y: 902,
	direction: 1
}, {
	name: "拔牙风俗与儿童夭折现象",
	x: 2073,
	y: 1400,
	direction: 2,
	desc: "M122号墓主人为一中年男性，其下颌骨脱落，并在下门齿中部留有早年拔牙的旧痕。,,M124号墓主人为一2-3岁小孩。在昙石山文化现已发现的近200座墓葬中，孩童比例约占30%，反映当时生活环境艰苦，儿童较易夭折。",
	pic: "byfs"
}, {
	name: "历史之谜",
	x: 2073,
	y: 1600,
	direction: 2,
	desc: "M130号墓主人为一中年女性，头骨被压扁，手指、脚趾骨和部分牙齿缺失，十分凌乱的肋骨、髌骨和散落的脊椎骨，这些异常现象令后人不解。该墓非二次墓，并无盗墓和动物扰乱痕迹，更非地震原因。她是死于非命？",
	pic: "lszm"
}, {
	name: "壕沟之一",
	x: 2322,
	y: 1977,
	direction: 1,
	desc: "G102号壕沟，属昙石山文化时期，深约2-3米，口大底小，沟两侧呈斜坡状，沟底略平。考古工作者在现场还特意保留了“关键柱”，可清晰看到壕沟的文化层剖面。壕沟是原始社会聚落周围防御野兽或外来入侵的设施，或是聚落与墓地的分界。",
	pic: "hgzy"
}, {
	name: "G102遗址平面图",
	x: 2835,
	y: 1977,
	direction: 1
}, {
	name: "陶窑",
	x: 2898,
	y: 2986,
	direction: 2,
	desc:"位于壕沟边沿的陶窑，他的制造时期晚于昙石山文化，属于距今3500-4300年间的黄瓜山文化时期。这种陶窑属椭圆形或圆形的无窑箅的横穴窑，窑炉直径不到1米。",
	pic:"ty"
}, {
	name: "大型油画-昙石山人生活场景",
	x: 4536,
	y: 1995,
	direction: 1
}, {
	name: "壕沟之二",
	x: 5658,
	y: 2561,
	direction: 2,
	desc:"G101号壕沟，根据考古层位关系，这条壕沟属于黄瓜山文化时期。这里展示的是在第八次发掘时清理出的局部地段，平面为长条形，斜直壁，近平底，并自北向南倾斜。2009年进行的第十次考古发掘进一步揭示了该壕沟的走向。",
	pic:"hgze"
}, {
	name: "双肢骨竖立之谜",
	x: 5295,
	y: 652,
	roate: "-49",
	direction: 1,
	desc:"G101号壕沟向北延伸的局部，沟沿发现一座昙石山文化时期的墓葬，墓主人下肢缺失，而沟底却残留一段斜立着的人下肢骨和一堆零乱的骨骼。有人误以为这是奴隶殉葬现象，其实是壕沟沟沿断裂垮塌所致。沟沿上的人骨与沟底的双肢骨实属一人。",
	pic:'sgsl'
}, {
	name: "黄土仑文化的祭祀遗迹",
	x: 7653,
	y: 216,
	direction: 2,
	desc:"H125号祭祀坑，摆放了3件原始瓷豆和1件红彩陶罐，其中两件豆盘中发现残存小型飞禽类动物的残骸，另一件豆盘中则摆放了5根大体上是同类动物的残肢骨。黄土仑文化属于福建的青铜时代文化，其年代与中原的商、周时期相当。", 
	pic:"htlwh"
}, {
	name: "狗坑",
	x: 7787,
	y: 431,
	direction: 2,
	desc:"M139号为殉狗坑，坑中有一具保存完整的狗骨架。", 
	pic:"xgk"
}];

var line = "M838 3384L891 3383L890.0001 1163.846L1965 1164L1965 2120C1965 2120 1965 2133 1978 2132C1992 2130 2859 2133 2859 2133L2860 2475C2860 2475 2858 2498 2875 2492C2892 2485 4272 2493 4272 2493L4274 3149C4274 3149 4278 3167 4289 3164C4301 3161 5593 3165 5593 3165C5593 3165 5609 3165 5607 3150C5605 3135 5608 1978 5608 1978L6722 1031L6722 982L6638 428L6592 434L6592 478L6668 991L5558 1936L5556 3112L4325 3113L4323 2452C4323 2452 4326 2439 4312 2442L2912 2440L2912 2095C2912 2095 2913 2081 2896 2081L2017 2081L2015 1127C2015 1127 2018 1107 1995 1113C1971 1119 851 1112 851 1112C851 1112 838.4615 1117.923 838.4615 1126.923C838 1127 839 3383 838 3384Z";
var line_point = [{
	x: 825,
	y: 3349,
	d: 0
}, {
	x: 825,
	y: 2957,
	d: 0
}, {
	x: 825,
	y: 2547,
	d: 0
}, {
	x: 825,
	y: 2024,
	d: 0
}, {
	x: 825,
	y: 1535,
	d: 0
}, {
	x: 889,
	y: 1100,
	d: 1
}, {
	x: 1290,
	y: 1100,
	d: 1
}, {
	x: 1726,
	y: 1100,
	d: 1
}, {
	x: 1954,
	y: 1387,
	d: 2
}, {
	x: 1954,
	y: 1806,
	d: 2
}, {
	x: 2162,
	y: 2075,
	d: 1
}, {
	x: 2580,
	y: 2075,
	d: 1
}, {
	x: 2851,
	y: 2277,
	d: 2
}, {
	x: 3146,
	y: 2435,
	d: 1
}, {
	x: 3573,
	y: 2435,
	d: 1
}, {
	x: 4000,
	y: 2435,
	d: 1
}, {
	x: 4263,
	y: 2583,
	d: 2
}, {
	x: 4263,
	y: 2981,
	d: 2
}, {
	x: 4567,
	y: 3105,
	d: 1
}, {
	x: 5125,
	y: 3105,
	d: 1
}, {
	x: 5544,
	y: 2817,
	d: 0
}, {
	x: 5544,
	y: 2285,
	d: 0
}, {
	x: 5725,
	y: 1771,
	d: 0.5
}, {
	x: 6153,
	y: 1413,
	d: 0.5
}, {
	x: 6650,
	y: 977,
	d: 0
}, {
	x: 6580,
	y: 420,
	d: 0
}, ];

function paintMap(R) {
	var color1 = {
			"fill": "#fcfccf",
			"stroke": "#cda441",
			"stroke-width": 5
		},
		color2 = {
			"fill": "#d9f0fb",
			"stroke": "#76cbf3",
			"stroke-width": 5
		},
		color3 = {
			"fill": "url(./img/fill_else.png)",
			"stroke": "#393838",
			"stroke-width": 5
		},
		color4 = {
			"fill": "#d9c7fc",
			"stroke": "#fb9090",
			"stroke-width": 5
		},
		color5 = {
			"fill": "#ffefef",
			"stroke": "#fb9090",
			"stroke-width": 5
		};
	shape.else_area = {
		name: "",
		istitle: false,
		path: R.path("M1303 869L1282 778L562 691L564 1464L636 1465L647 1456L647 872C647 872 1299 869 1303 869ZM647 2534L567 2535L569 3989L1376 3990L1377 3808L2411 3807L3158 4036L3158 3684L3012 3683L3011 3385L647 3383C647 3383 648 2531 647 2534ZM4043 3383L4043 4093L4457 4097L4453 3380C4453 3380 4053 3373 4043 3383ZM5030 3383L5033 4093L5930 4230L5937 3627L5773 3620L5767 3387L5030 3383ZM5393.333 1935L5298.333 1935L5302 1788L5194 1786L5196 1652L5308.667 1646.333L5312.667 1436.333L4780 1032L5618 98L6058 410L6366 362L6372 260L6692 196L6778 300L7016 266L7732 -8L8092 606L5946 1940L5776 1938L6898 1214L6830 1122L7286 900L7314 950L7982 580L7704 96L7020 360L6038 522L5626 216L4898 1036L5392 1406C5392 1406 5401.333 1942 5393.333 1935Z").attr(color3)
	}
	shape.qt = {
		name: "前厅",
		istitle: true,
		path: R.path("M648 874L2194 872L2196 1936L3012 1938L3012 3382L1842 3382L1838 2832L646 2828C646 2828 652 872 648 874ZM964 1234L966 2260L1838 2258L1838 1474L1246 1472L1244 1234C1244 1234 968 1234 964 1234ZM2132 2252L2134 2828L2758 2834L2756 2254L2132 2252Z").attr(color2)
	};
	shape.cj = {
		name: "场景",
		istitle: false,
		path: R.path("M960 1233L1237 1237L1243 1473L1837 1477L1837 2267L963 2257C963 2257 957 1219 960 1233Z").attr(color1)
	};
	shape.zt = {
		name: "中厅",
		istitle: true,
		path: R.path("M4443 1940L4040 1937L4047 3383L5770 3383L5767 1940L5330 1940L5327 2820L4453 2823L4443 1940Z").attr(color2)
	};
	shape.xxq = {
		name: "休息厅",
		istitle: true,
		roate: "-45",
		path: R.path("M5393 1407L5390 1933L5770 1933L6890 1217L6827 1117L7283 900L7017 360L6040 520L6343 757L5610 1570L5393 1407Z").attr(color4)
	};
	shape.ht = {
		name: "后厅",
		istitle: true,
		path: R.path("M7310 953L7690 740L7333 240L7013 360C7013 360 7313 943 7310 953Z").attr(color2)
	};
	shape.cj2 = {
		name: "场景",
		istitle: false,
		roate: "-49",
		path: R.path("M4907 1040L5613 1567L6347 757L5630 220C5630 220 4911 1033 4907 1040Z").attr(color1)
	};
	shape.cj3 = {
		name: "场景",
		istitle: false,
		path: R.path("M7333 243L7697 733L7973 573L7697 97L7333 243Z").attr(color1)
	};
	shape.cs = {
		name: "厕所",
		istitle: true,
		path: R.path("M4447 3383L4450 4093L5033 4083L5030 3377C5030 3377 4441 3376 4447 3383Z").attr(color5)
	};
	shape.cj4 = {
		name: "场景",
		istitle: false,
		path: R.path("M4450 1940L4453 2827L5330 2823L5330 1940C5330 1940 4457 1940 4450 1940Z").attr(color1)
	};
	shape.xxs1 = {
		name: "休息厅",
		istitle: true,
		path: R.path("M3007 2090L3010 2830L4040 2833L4040 2090C4040 2090 3014 2090 3007 2090Z").attr(color4)
	};
	shape.mt = {
		name: "门厅",
		istitle: true,
		path: R.path("M646.6667 2833.333L650 3380L1837 3380L1840 2830C1840 2830 653 2833 647 2833Z").attr(color2)
	};
	shape.cj5 = {
		name: "场景",
		istitle: false,
		path: R.path("M965 1234L1244 1234L1243 1473L1840 1472L1842 2261L968 2260C963 2266 962 1220 965 1234Z").attr(color1)
	};
	shape.cj6 = {
		name: "场景",
		istitle: false,
		path: R.path("M2130 2257L2133 2830L2753 2830L2753 2257C2753 2257 2127 2261 2130 2257Z").attr(color1)
	};
}